#!/bin/bash

# 定义要测试的 IP、端口和备注
targets=(

  "172.30.16.26:8848:nacos_26_8848"
  "172.30.17.18:2883:鹊桥/cms_dev数据库_18_2883"
  "172.30.17.50:4000:tidb_50_4000"
  "172.30.17.56:9200:es_56_9200"
  "172.30.17.57:9200:es_57_9200"
  "172.30.17.58:9200:es_58_9200"
  "172.30.17.59:9092:kakfa_bigData_59_9092"
  "172.30.17.60:9092:kakfa_bigData_60_9092"
  "172.30.17.61:9092:kakfa_bigData_61_9092"
  "172.30.17.62:7001:redis_62_7001"
  "172.30.17.63:7001:redis_63_7001"
  "172.30.17.64:7001:redis_64_7001"
  "172.30.17.62:7002:redis_62_7002"
  "172.30.17.63:7002:redis_63_7002"
  "172.30.17.64:7002:redis_64_7002"
  "172.30.50.14:9030:starrocks_14_9030"




  "43.198.68.123:9092:kakfa_cw_123_9092"
  "43.198.68.123:9092:kakfa_cw_123_9093"
  "43.198.68.123:9092:kakfa_cw_123_9094"

  "16.163.245.213:9092:kakfa_cw_232_9092"
  "16.163.245.213:9093:kakfa_cw_232_9093"
  "16.163.245.213:9094:kakfa_cw_232_9094"
)

# 遍历列表逐个测试
for target in "${targets[@]}"; do
  ip=$(echo $target | cut -d: -f1)
  port=$(echo $target | cut -d: -f2)
  remark=$(echo $target | cut -d: -f3)

  echo -n "Testing $ip:$port ($remark) ... "
  nc -vz -w 3 $ip $port &>/dev/null

  if [ $? -eq 0 ]; then
    echo "✅ Connected"
  else
    echo "❌ Failed"
  fi
done
